*** use-package 
#+begin_src emacs-lisp :tangle yes
(package-refresh-contents)
(use-package plantuml-mode
							:ensure t

    ;; ;; Sample jar configuration
    ;; (setq plantuml-jar-path "/path/to/your/copy/of/plantuml.jar")
    ;; (setq plantuml-default-exec-mode 'jar)

    ;; ;; Sample executable configuration
    ;; (setq plantuml-executable-path "/path/to/your/copy/of/plantuml.bin")
    ;; (setq plantuml-default-exec-mode 'executable)

		;; plantuml-server-url
		;; It defaults to "https://www.plantuml.com/plantuml".

;; You can also download the latest version of PlantUML straight into plantuml-jar-path:
;; M-x plantuml-download-jar<RET>

;; Enable plantuml-mode for PlantUML files
(add-to-list 'auto-mode-alist '("\\.plantuml\\'" . plantuml-mode))

;; You can tell plantuml-mode to autocomplete the word before the cursor by typing M-x plantuml-complete-symbol. This will open a popup with all the available completions as found in the list of keywords given by running PlantUML with the -language flag.

;; C-c C-c  plantuml-preview: renders a PlantUML diagram from the current buffer in the best supported format
;; C-u C-c C-c  plantuml-preview in other window
;; C-u C-u C-c C-c plantuml-preview in other frame
;; If you want to force a specific output format, you can customize the variable plantuml-output-type to the value you prefer.

;; plantuml-enable-debug
;; plantuml-disable-debug
	)
#+end_src
#+begin_src emacs-lisp :tangle yes
(find-file-other-frame "e:/Temp/tmpuml.plantuml")
#+end_src

#+RESULTS:
: #<buffer tmpuml.plantuml>

(package-refresh-contents)
#+begin_src emacs-lisp :tangle yes
(use-package plantuml-mode
							:ensure t
  :config
	(setq org-plantuml-jar-path 
		(expand-file-name "~/AddApps/plantuml/plantuml.1.2021.0.jar"))
	(setq plantuml-jar-path "~/AddApps/plantuml/plantuml.1.2021.0.jar")
	(setq plantuml-default-exec-mode 'jar)
	;; (setq plantuml-output-type "txt")
	(add-to-list 'org-src-lang-modes '("plantuml" . plantuml))
	(org-babel-do-load-languages 
		'org-babel-load-languages 
		'((plantuml . t)))
	(define-key plantuml-mode-map (kbd "<f5>") '(lambda() (interactive)
					(save-some-buffers 'no-confirm)
					(org-save-all-org-buffers)
					(evil-normal-state)
					(plantuml-preview 1)))				
	(add-to-list 'auto-mode-alist '("\\.plantuml\\'" . plantuml-mode))
	)
#+end_src

#+RESULTS:
: t

